{
    "id": "1",
    "attributes": {
        "blogTitle": "Digesting phenomenological exegeses of everydayness",
        "blogDesc": " Exploring Lefebvre's opposing forces in everyday life through digital scholarship and personal reflections.",
        "imgCaption": "Exploring Lefebvre's sociological lens on everyday life, this blog delves into the opposing forces of desire vs. need, natural vs. artificial, and dream vs. reality. Reflecting on digital scholarship, it examines the relevance of his ideas, shares personal insights, and poses rhetorical questions.",
        "blogDate": "2024-09-03",
        "authorName": "Sanskriti Satyakam",
        "blogContent": [
            {
                "type": "paragraph",
                "children": [
                    {
                        "text": "Exegesis 1 : The Lefebvrian Dissection of Digital Everydayness",
                        "type": "text"
                    }
                ]
            },
            {
                "type": "paragraph",
                "children": [
                    {
                        "text": "Henri Lefebvre, in Myths in Everyday, has put on a unique sociological lens that the everyday can be seen through. He has made an effort to subtly push the unquestioned dubiety that the everyday is suffused with. Much of this work of his is drawn upon the ideology of the existence of two forces in the everyday, that are chronically opposing, however, situationally share some parallels. I have selected three pairs of such forces to ponder upon in this blogpost- desire and need, natural and artificial, and dream and reality.",
                        "type": "text"
                    }
                ]
            },
            {
                "type": "paragraph",
                "children": [
                    {
                        "text": "I have identified a few instances in today’s digital scholarship that are indicative of the practicality and relevance of Lefebvre’s ideas. In addition, I have shared some of my thoughts that are underpinned by his ideas and are reflective of my understanding of the concepts proposed by him. I have also raised some meticulously framed rhetorical questions and humbly contested some of his thoughts. I have also raised some meticulously framed rhetorical questions.",
                        "type": "text"
                    }
                ]
            },
            {
                "type": "paragraph",
                "children": [
                    {
                        "text": "One of the sets of interrelated dialectical movements that characterize the everyday were- need and desire, and their interrelatedness was described as follows- “In this perpetual conflict between desire and need, there is a dialectical unity between the two, while at the same time perpetual opposition and contradiction.” (Kofman & Lebas, 2003, p. 100). Employing this Lefebvrian approach, Yamamoto (2018) asserts that there is a possibility of the basis for modern day urban planning, to be inclined towards ‘desires’. In addition, he acknowledged the room for further consideration on Lefebvre’s notion of ‘desire’ and ‘need’, in relation to other urban theorists.",
                        "type": "text"
                    }
                ]
            },
            {
                "type": "paragraph",
                "children": [
                    {
                        "text": "Another such dialectical movement in the everyday was represented in the confrontation between the ‘natural’ described as “what comes from nature and is part of all social constructions” and ‘artificial’ described as “what comes from culture, inasmuch as this culture is precisely detached from nature and opposed to nature” (Kofman & Lebas, 2003, p. 100). One case in which I see traces of the ‘natural’ in ‘artificial’ is that of digital media— more specifically, social media. The ‘natural’ in this case is the innate ‘sociality’ of human beings, that the virtual or ‘artificial’ space of social media is foregrounded on.",
                        "type": "text"
                    }
                ]
            },
            {
                "type": "paragraph",
                "children": [
                    {
                        "text": "“... one feature of this mythology of modern times is perpetual movement from dream to reality…” (Kofman & Lebas, 2003, p. 101) and again, social media is exemplary of this. The enactment of selective self-presentation by social media users, by choosing, editing and posting photographs to social networking sites (Fox & Vendemia, 2016) makes a good case that demonstrates the dwindling line between dream and reality.",
                        "type": "text"
                    }
                ]
            },
            {
                "type": "paragraph",
                "children": [
                    {
                        "text": "Drawing on the mythified nature that the products of advertising and marketing actions possess (Kofman & Lebas, 2003), it can be questioned whether it is the unrealistic standards of beauty, set by these actions (through systematic and consistent sexism and oversexualization) (Greenfield, 2018), that social media users make subconscious efforts to align with when engaging in selective self-presentation.",
                        "type": "text"
                    }
                ]
            },
            {
                "type": "paragraph",
                "children": [
                    {
                        "text": "One of the ways in which the myths of everyday life were categorized was “myths of love” which was described as follows- “As far as love goes, it’s agreed nowadays that it’s a big failure.” (Kofman & Lebas, 2003, p. 103) and I would like to contest this notion of mythification of love today, by Lefebvre. Innumerable books such as Why Relationships Fail (Griggs, 2018), blogs such as 5 Key Reasons You Can’t Find Love, According to Experts (Lloyd, 2021), Podcasts and YouTube videos such as The Biggest Problem With Relationships Today (The Roommates, 2021) make me question if these understandings of the modern day love are just another instance of mythified notions in everyday life or a tactile issue facing people of the society.",
                        "type": "text"
                    }
                ]
            },
            {
                "type": "paragraph",
                "children": [
                    {
                        "text": "I think, the self-discrepancy theory (Higgins, 1987) is in congruence with myth, ideology and utopia, in the sense that myth is congruent to, ideology is congruent to, utopia is congruent to. Throughout Lefebvre’s work, I could spot instances that encompassed the clash of myth, ideology and utopia. Not only was I able to perceive the presence of this clash in my aforementioned example of social media (For example- The role of self-discrepancy in mediating body satisfaction on Instagram (Ahadzadeh et al., 2017)), but also in the following accounts from his work-",
                        "type": "text"
                    }
                ]
            },
            {
                "type": "paragraph",
                "children": [
                    {
                        "text": "“In this family lore is the story (belatedly fictionalized to some extent) of how one’s parents met, how they fell in love, or out of love, and how they lived. A family folklore stuffed with myths. These are the myths about the past.” (Kofman & Lebas, 2003, p. 104).",
                        "type": "text"
                    }
                ]
            },  
            {
                "type": "paragraph",
                "children": [
                    {
                        "text": "“On the same level, there are myths about the future: what we will do, what we would do.” (Kofman & Lebas, 2003, p. 105).",
                        "type": "text"
                    }
                ]
            }  
        ],
        "createdAt": "2024-09-03T05:18:01.425Z",
        "updatedAt": "2024-09-03T05:18:08.220Z",
        "publishedAt": "2024-09-03T05:18:08.204Z",
        "coverImg": {
                "src":"https://github.com/dsnum1/blog-pmgs/blob/main/media/digital_everydayness.jpg?raw=true",
                "imgCaption":"Exploring Lefebvre's sociological lens on everyday life, this blog delves into the opposing forces of desire vs. need, natural vs. artificial, and dream vs. reality. Reflecting on digital scholarship, it examines the relevance of his ideas, shares personal insights, and poses rhetorical questions."
            },
        "profileImg": {
            "src":"https://github.com/dsnum1/blog-pmgs/blob/main/media/profilePic.png?raw=true",
            "imgCaption":"Cover Image for the blog"
        }
    }
}
